benchmarks/OpenFOAM/2D/parasiticRipples/N200/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

application=$(getApplication)

restore0Dir
runApplication blockMesh 
runApplication topoSet -dict system/topoSetDict.c0 
runApplication refineMesh -overwrite -dict system/refineMeshDict.c0
runApplication setWaveField

runApplication decomposePar
runParallel ${application}

#------------------------------------------------------------------------------
